@extends('layouts.default')
@section('content')
<div class="main-detail">
    <div class="container">
        <div class="main-show clearfix">
            <div class="left-line">

            </div>
            <div class="show-jobs">
                <div class="job-mail">
                    <p>简历投至：hr@travos.cn</p>
                </div>
                <h3>招聘职位</h3>
                <h4>前端开发工程师</h4>
                <h5>「职责：希望由你来做」</h5>
                <p>1. 负责网站和手机终端的界面交互开发；</p>
                <p>2. 负责就旅行通用基础业务的前端开发；</p>
                <p>3. 在移动设备上，追求极致的用户体验。</p>
                <h5>「要求：我们需要的你」</h5>
                <p>1. 深入理解W3C标准与ES规范，熟悉Web语义化，掌握盒模型、常用布局以及浏览器兼容性；</p>
                <p>2. 有HTML5与CSS3开发经验者加分；</p>
                <p>3. 有ES5开发经验和了解ES6的攻城狮加分；</p>
                <p>4. 熟练使用各种调试抓包工具，能独立分析、解决和归纳问题；</p>
                <p>5. 有移动设备调试经验者加分；</p>
                <p>6. 熟悉性能调优者加分；</p>
                <p>7. 熟练使用至少一种JS框架，掌握其原理，能独立开发常用组件；</p>
                <p>8. 熟悉常用MV*框架者加分；</p>
                <p>9. 熟悉常用设计模式者加分；</p>
                <p>10. 掌握至少一门服务器端编程语言，并有实战经验；</p>
                <p>11. 对业界最新的前端技术和实现有浓厚的兴趣和深入见解；</p>
                <p>12. 诚信，务实，团队主义者，优秀的逻辑分析能力，良好的沟通能力，刨根问底的精神。</p>
                <div class="mart-30"></div>
                <h4>Java开发工程师</h4>
                <h5>「职责：希望由你来做」</h5>
                <p>1. 参与基础架构、数据库中间件开发、自动化构建、稳定性等重大项目推进与研发工作；</p>
                <p>2. 参与用户关系、Timeline、Feed、消息通知等日常需求研发工作；</p>
                <p>3. 参与系统改造、架构演变等改造型研发工作。</p>
                <h5>「要求：我们需要的你」</h5>
                <p>1. 两年及以上Unix/Linux平台下高性能服务器端架构设计与开发经验，对分布式系统、数据分析等熟悉者优先考虑；</p>
                <p>2. 扎实的编程基础, 系统,网络及应用性能优化等方面问题的分析和解决能力；</p>
                <p>3. 熟练掌握Java/Go等后端开发语言，了解Jvm的运作机制；</p>
                <p>4. 能够熟练使用Shell/Python等脚本语言辅助完成日常任务；</p>
                <p>5. 具有较强的分析, 解决问题, 方案设计的能力, 以及持续学习和业务推进的能力；</p>
                <p>6. 熟悉Docker、MC、Redis、Mysql、Mongodb、HBase等基础组件源码和模块开发, 有大规模在线服务开发经验者优先。</p>
            </div>
        </div>
    </div>
</div>
@stop
